#pragma once
//使用するヘッダーファイル
#include "GameL\SceneObjManager.h"

//使用するネームスペース
using namespace GameL;

//オブジェクト：タイトル
class CObjClearName :public CObj
{
	public:
		CObjClearName() {};
		~CObjClearName() {};
		void Init();	//イニシャライズ
		void Action();	//アクション
		void Draw();	//ドロー

	private:
		int choice;
		int m_time;		//キーの入力時間間隔
		bool m_key_flag;
		char m_name_key[6][17] = { { 'あ','い','う','え','お','　','ま','み','む','め','も','　','が','ぎ','ぐ','げ','ご', },
									{'か','き','く','け','こ','　','や','　','ゆ','　','よ','　','ざ','じ','ず','ぜ','ぞ',},
									{'さ','し','す','せ','そ','　','ら','り','る','れ','ろ','　','だ','ぢ','づ','で','ど',}, 
									{'た','ち','つ','て','と','　','わ','　','を','　','ん','　','ば','び','ぶ','べ','ぼ',},
									{'な','に','ぬ','ね','の','　','ぁ','ぃ','ぅ','ぇ','ぉ','　','ぱ','ぴ','ぷ','ぺ','ぽ',},
									{'は','ひ','ふ','へ','ほ','　','っ','　','ゃ','ゅ','ょ','　','　','消す','　','　','決定', } };
};

